[
  {
    "class": "книга",
    "name": "книга",
    "name1": "книгу",
    "descriptions":
    [
        ["Старая", "Старую"],
        ["Древняя", "Древнюю"],
        ["Пыльная", "Пыльную"],
        ["Зачитанная", "Зачитанную"],
        ["Новая", "Новую"],
        ["Потрепанная", "Потрепанную"],
        ["Красивая", "Красивую"],
        ["Большая", "Большую"]
    ],
    "texts":
    [
        [0, "Книга повествует о временах мастеров-фехтовальщиков. Тогда величайшим достижением считалось заколоть соперника в честном поединке на шпагах."],
        [0, "В книге во всех красках описывается история двух друзей-авантюристов, которые берутся за любое, даже самое опасное дело. Попав в беду они всегда с чудом избегают гибели благодаря их умениям в бою на шпагах."],
        [0, "Это история о молодой девушке, отец которой считает, что она добьется всего сама, если будет обладать характером и умением фехтовать. Уроки отца девушки описаны подробно и основательно, что позволяет читателю почерпнуть много нового."],
        [1, "Книга рассказывает о злобных пиратах под предводительством со знаменитым капитаном Рыжая (с проседью) Борода, который был великим мастером сабли."],
        [1, "Повествование в книге ведется от лица боцмана пиратской шхуны, бороздившей южные моря. Команда корабля не гнушалась любой добычи и нападала на любые проходящие мимо суда. Не сгинуть в морской пучине главному герою помогает его мастерское владение саблей."],
        [1, "Автор книги провел несколько лет в пиратском логове в качестве врача. Наблюдая за жизнью пиратов, за их тренировками, он составил подробное описание боевого стиля пиратских воинов."],
        [2, "В книге описывается жизнь вождя викингов Олафа, который ходил в походы на соседние земли и прославился тем, что дрался только своей любимой дубиной."],
        [2, "Книга представляет собой вольное изложение легенд северных народов с особым упором на ратные подвиги героев и их умения в применении ударного оружия."],
        [2, "История кузница в норвежской деревне начинается мирно и размеренно, но резко превращается в абсолютный кошмар после эпизода убийства его семьи воинами соседнего племени. Бросив кузницу и вооружившись лишь своим молотом герой отправляется мстить."]
    ],
    "decorations":
    [
        "о мушкетерах",
        "о пиратах",
        "о викингах"
    ],
    "weapon_types":
    [
        "колющее",
        "рубящее",
        "ударное"
    ],
    "armor_types":
    [
        0,
        0,
        0
    ],
    "shield_types":
    [
        0,
        0,
        0
    ]
  }
  ]