[
    {
        "class_name": "ThrustingWeaponBook",
        "decoration": "о мушкетерах",
        "examine_text": "Эта книга будет полезна всем, кто использует в бою колющее оружие.",
        "can_use_in_fight": false,
        "base_price": 7,
        "price_dice": {
            "dice": true,
            "value": 8
            },
        "texts": [
        "Книга повествует о временах мастеров-фехтовальщиков. Тогда величайшим достижением считалось заколоть соперника в честном поединке на шпагах.",
        "В книге во всех красках описывается история двух друзей-авантюристов, которые берутся за любое, даже самое опасное дело. Попав в беду они всегда чудом избегают гибели благодаря их умениям в бою на шпагах.",
        "Это история о молодой девушке, отец которой считает, что она добьется всего сама, если будет обладать характером и умением фехтовать. Уроки отца девушки описаны подробно и основательно, что позволяет читателю почерпнуть много нового."
        ]
    },
    {
        "class_name": "CuttingWeaponBook",
        "decoration": "о пиратах",
        "examine_text": "Эта книга поможет лучше разобраться с приемами рубящего оружия.",
        "can_use_in_fight": false,
        "base_price": 7,
        "price_dice": {
            "dice": true,
            "value": 8
            },
        "texts": [
        "Книга рассказывает о злобных пиратах под предводительством знаменитого капитана Рыжая (с проседью) Борода, который был великим мастером сабли.",
        "Повествование в книге ведется от лица боцмана пиратской шхуны, бороздившей южные моря. Команда корабля не гнушалась любой добычи и нападала на любые проходящие мимо суда. Не сгинуть в морской пучине главному герою помогает его мастерское владение саблей.",
        "Автор книги провел несколько лет в пиратском логове в качестве врача. Наблюдая за жизнью пиратов, за их тренировками, он составил подробное описание боевого стиля пиратских воинов."
        ]
    },
    {
        "class_name": "BluntgWeaponBook",
        "decoration": "о викингах",
        "examine_text": "Эта книга написана для всех, кто предпочитает ударное оружие в бою.",
        "can_use_in_fight": false,
        "base_price": 7,
        "price_dice": {
            "dice": true,
            "value": 8
            },
        "texts": [
        "В книге описывается жизнь вождя викингов Олафа, который ходил в походы на соседние земли и прославился тем, что дрался только своей любимой дубиной.",
        "Книга представляет собой вольное изложение легенд северных народов с особым упором на ратные подвиги героев и их умения в применении ударного оружия.",
        "История кузница в норвежской деревне начинается мирно и размеренно, но резко превращается в абсолютный кошмар после эпизода убийства его семьи воинами соседнего племени. Бросив кузницу и вооружившись лишь своим молотом герой отправляется мстить."
        ]
    },
    {
        "class_name": "TrapsBook",
        "decoration": "о взломщиках",
        "examine_text": "Эта книга рассказывает о тайных воровских искусствах обезвреживания ловушек.",
        "can_use_in_fight": false,
        "base_price": 7,
        "price_dice": {
            "dice": true,
            "value": 8
            },
        "texts": [
        "Книга рассказывает про команду взломщиков сейфов, которая сталкивается с самым сложным вызовом в своей карьере, пытаясь проникнуть в неприступное хранилище, охраняемое страшными ловушками.",
        "Книга описывает мир, где заклинания могут открывать любые двери. Группа храбрых плутов бросает вызов забытому замку, полному магических загадок и смертельных ловушек, чтобы обнаружить сокровище, способное изменить судьбы.",
        "В книге описывается как в зачарованном лесу, где каждое дерево и камень хранит свои тайны, молодой вор предпринимает опасное путешествие к сердцу древнего лабиринта, полного мистических ловушек и неизведанных опасностей, в поисках затерянного сокровища великих магов."
        ]
    },
    {
        "class_name": "WisdomBook",
        "decoration": "об ученых",
        "examine_text": "Эта книга полна мудрости и знаний, которые помогут читателю стать умнее.",
        "can_use_in_fight": false,
        "base_price": 20,
        "price_dice": {
            "dice": true,
            "value": 15
            },
        "texts": [
        "Книга представляет собой энциклопедию. Автор - монах из скрытого от посторонних глаз монастыря - кропотливо и во всех подробностях описывает вещи и явления из самых разных сфер жизни.",
        "Книгу написал дипломат, служивший при дворе заморских королей. Книга полна изречений мудрых правителей, их мыслей по поводу всего на свете.",
        "Книга описывает жизненный путь великого ученого мужа, закончившего свои дни в обсерватории в Северных горах. За свою долгую жизнь этот умнейший человек интересовался разнообразными вопросами и достиг глубокого понимания природы вещей."
        ]
    },
    {
        "class_name": "ShieldsBook",
        "decoration": "об щитах",
        "examine_text": "Эта книга рассказывает о техниках использования щита.",
        "can_use_in_fight": false,
        "base_price": 10,
        "price_dice": {
            "dice": true,
            "value": 10
            },
        "texts": [
        "История о том, как один воин смог выстоять против целой орды врагов, используя лишь свою смекалку и кусок дерева, найденный на поле боя.",
        "Трактат о философии защиты, где автор рассуждает о том, как важно уметь не только нападать, но и защищать свои ценности, свою семью, свою честь.",
        "Повесть о странствующем рыцаре, который всегда носил с собой не только меч, но и верного спутника, помогавшего ему в трудные минуты.",
        "Дневник солдата, который прошел через множество битв и научился ценить не только свою жизнь, но и жизни своих товарищей, прикрывая их спины в бою."
        ]
    },
    {
        "class_name": "ArmorBook",
        "decoration": "о защите",
        "examine_text": "Эта книга описывает новейшие и классические модели брони, а также истории, с ними связанные.",
        "can_use_in_fight": false,
        "base_price": 10,
        "price_dice": {
            "dice": true,
            "value": 10
            },
        "texts": [
        "История о кузнеце, который мог выковать не только меч, но и защиту от любого удара, броню, которая делала воина неуязвимым.",
        "Описание путешествия героя, который ищет легендарные латы, способные защитить от магии и превратить его в непобедимого воина.",
        "Трактат о том, как правильно подобрать себе одеяние для битвы, чтобы оно не только защищало, но и не сковывало движений.",
        "Сборник советов о том, как ухаживать за своей броней, чтобы она служила долго и надежно, не теряя своих защитных свойств.",
        "Повесть о том, как один воин смог выжить в самой страшной битве, потому что на нем была надета особая кольчуга, сплетенная из волшебных нитей.",
        "Руководство по изготовлению защитного облачения из подручных материалов, таких как кожа, дерево и кости животных.",
        "История о том, как один человек смог спастись от верной смерти, потому что на нем была надета особая броня, способная поглощать удары."
        ]
    }
]